# def log_filter(filename, keyword):
#     with open(filename, 'r') as file:  # with — це контекстний менеджер,
#         # конструкція, яка гарантує, що певна дія (наприклад, закриття файлу, з'єднання
#         # з базою даних, звільнення ресурсу) завжди виконується, навіть якщо в середині
#         # блоку коду стався виняток
#         for line in file:
#             if keyword in line:
#                 yield line.strip()  # повертає відфільтрований рядок
#
# # використання (файл має існувати!)
# for log in log_filter('C:/!Files/text/kobzar.txt', 'серце'):
#     print(log)  # виводить тільки рядки з 'серце', не завантажуючи весь файл у пам'ять

#///////////////////////////////////////////////////////////////////////////////////////////////////////////

# # використання (файл має існувати!)
# gen = log_filter('C:/!Files/text/kobzar.txt', 'серце')
# print(next(gen))
# print("============================")
# print(next(gen))

#///////////////////////////////////////////////////////////////////////////////////////////////////////////

# def decorator(f):
#     def wrapper():
#         print("щось до виклику функції")
#         f() # декорована функція
#         print("щось після виклику функції")
#     return wrapper
#
# @decorator
# def func():
#     print("моя дуже корисна функція, яка робить щось круте, і я не можу в неї зайти щоб змінити її код")
#
#
# func()
# func()

#///////////////////////////////////////////////////////////////////////////////////////////////////////////

# def decorator(f):
#     def wrapper(*args, **kwargs):
#         print("щось до виклику функції")
#         f(*args, **kwargs)
#         print("щось після виклику функції")
#     return wrapper
#
#
# @decorator
# def func():
#     print("моя дуже корисна функція, яка робить щось круте, і я не можу в неї зайти щоб змінити її код")
#
#
# @decorator
# def second(a, b):
#     print(a + b)
#
#
# func()
# func()
#
# second(10, 20)
# second(a=15, b=25)

#///////////////////////////////////////////////////////////////////////////////////////////////////////////

# def decorator(f):
#     def wrapper():
#         print("щось до виклику функції")
#         f() # декорована функція
#         print("щось після виклику функції")
#
#     return wrapper
#
# # @decorator
# def func():
#     print("моя дуже корисна функція, яка робить щось круте, і я не можу в неї зайти щоб змінити її код")
#
#
# func = decorator(func)
#
# func()
# func()

#///////////////////////////////////////////////////////////////////////////////////////////////////////////

# def decorator(f):
#     def wrapper(*args, **kwargs):
#         print("щось до виклику функції")
#         result = f(*args, **kwargs)  # декорована функція
#         print("щось після виклику функції")
#         return result
#
#     return wrapper
#
#
# input = decorator(input)
#
# number = input("Please, enter some number: ")
# print(number)

#///////////////////////////////////////////////////////////////////////////////////////////////////////////

# class Person:
#     # constructor
#     # перевантаження нема, на поміч придуть *args, **kwargs
#     # public protected private - не прийнято вживати (все за замовчуванням публічне)
#     def __init__(self, name:str, age:int):
#         self.name = name
#         self.age = age
#
# p1 = Person("Oleksandr", 36)
# print(p1.name, p1.age)
#
# p2 = Person("Maryna", 27)
# print(p2.name, p2.age)

#///////////////////////////////////////////////////////////////////////////////////////////////////////////

# class Person:
#     name: str # static (class) attributes / field
#     age: int

#///////////////////////////////////////////////////////////////////////////////////////////////////////////

# class Person:
#     def __init__(self, name:str, age:int):
#         self.name = name
#         self.age = age
#
#     def print(self):
#         print(self.name, self.age)
#
# p1 = Person("Oleksandr", 36)
# p1.print()
#
# p2 = Person("Maryna", 27)
# p2.print()

#///////////////////////////////////////////////////////////////////////////////////////////////////////////